# FaceIsNoLongerVertical Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..WallFailures..::..FaceIsNoLongerVertical Property
BuiltInFailures..::..WallFailures Class See Also
---
Face defining this vertical Wall is no longer vertical.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId FaceIsNoLongerVertical { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FaceIsNoLongerVertical As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ FaceIsNoLongerVertical {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..WallFailures Class
Autodesk.Revit.DB Namespace